import numpy as np

#1. 데이터
x1 = np.array([1,2,3])
print('x1 = ',x1.shape)
#데이터의 구조를 알 수있다. x1 =  (3,) 스칼라가 3개인 벡터

x2 = np.array([[1,2,3]])
print('x2 = ',x2.shape)
#x2 =  (1, 3)

x3 = np.array([[1,2],[3,4]])
print('x3 =', x3.shape) #x3 = (2, 2)

x4 = np.array([[1,2],[4,5],[7,8]])
print('x4 =',x4.shape) #x4 = (3, 2)

x5 = np.array([[[1,2],[3,4],[5,6]]])
print('x5 =',x5.shape)#x5 = (1, 3, 2)

x6 = np.array([[[1,2],[3,4]],[[5,6],[7,8]]])
print('x6 =',x6.shape)#x6 = (2, 2, 2)

x7 = np.array([[[[1,2,3,4,5],[6,7,8,9,0]]]])
print('x7 =',x7.shape) #x7 = (1, 1, 2, 5)
x8 = np.array([[1,2,3],[4,5,6]])
print('x8 =',x8.shape) #x8 = (2, 3)

x9 = np.array([[[[1]]],[[[2]]]])
print('x9 =',x9.shape) #x9 = (2, 1, 1, 1)

### x10 재밌게 하나 만들기
x10 = np.array([[[[[[[[[[[[[[[[[[[[[[[1,2,3],[1,2,3]],[[1,2,3],[1,2,3]]]]]]]]]]]]]]]]]]]]]]])
print('x10 =',x10.shape) #x10 = (1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 3)


# 인공지능에서는 대부분 행렬로 되어진 데이터가 많다.
# 스칼라/ 벡터/ 행렬(매트리스)/ 텐서
# 1,2,3 0차원/ [1,2,3] 1차원 / [1,2,3],[1,2,3] 2차원/ ([1,2,3],[1,2,3]),([1,2,3],[1,2,3]) 3~4차원

